In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["john","dane", "jack"],
    "last": ["doe","martin","smith"],
    "email": ["johndoe@gmail.com", "danemartin@gmail.com","jacksmith@gmail.com"]
}

In [3]:
df = pd.DataFrame(people)
df

  first    last                 email
0  john     doe     johndoe@gmail.com
1  dane  martin  danemartin@gmail.com
2  jack   smith   jacksmith@gmail.com

In [4]:
# Add column

df["full_name"] = df["first"]+ " " + df["last"]
df

  first    last                 email    full_name
0  john     doe     johndoe@gmail.com     john doe
1  dane  martin  danemartin@gmail.com  dane martin
2  jack   smith   jacksmith@gmail.com   jack smith

In [5]:
# Drop multiple columns

df.drop(columns=['first','last'])

                  email    full_name
0     johndoe@gmail.com     john doe
1  danemartin@gmail.com  dane martin
2   jacksmith@gmail.com   jack smith

In [6]:
df

  first    last                 email    full_name
0  john     doe     johndoe@gmail.com     john doe
1  dane  martin  danemartin@gmail.com  dane martin
2  jack   smith   jacksmith@gmail.com   jack smith

In [7]:
df.drop(columns=['first','last'], inplace=True)
df

                  email    full_name
0     johndoe@gmail.com     john doe
1  danemartin@gmail.com  dane martin
2   jacksmith@gmail.com   jack smith

In [8]:
# Split column ie splitting full-name column

df['full_name'].str.split(" ", expand=True)

      0       1
0  john     doe
1  dane  martin
2  jack   smith

In [9]:
# Split and add two columns

df[['first', 'last']] = df['full_name'].str.split(" ", expand=True)
df

                  email    full_name first    last
0     johndoe@gmail.com     john doe  john     doe
1  danemartin@gmail.com  dane martin  dane  martin
2   jacksmith@gmail.com   jack smith  jack   smith

In [10]:
# Add single row to dataframe

new_row = pd.DataFrame({"email":"tonyferguson@email.com","first": "Tony", "last":"ferguson"}, index=[3])

df2 = pd.concat([new_row, ])
df2

                    email first      last
3  tonyferguson@email.com  Tony  ferguson

In [11]:
df2

                    email first      last
3  tonyferguson@email.com  Tony  ferguson

In [12]:
df

                  email    full_name first    last
0     johndoe@gmail.com     john doe  john     doe
1  danemartin@gmail.com  dane martin  dane  martin
2   jacksmith@gmail.com   jack smith  jack   smith

In [13]:
df2

                    email first      last
3  tonyferguson@email.com  Tony  ferguson

In [14]:
df

                  email    full_name first    last
0     johndoe@gmail.com     john doe  john     doe
1  danemartin@gmail.com  dane martin  dane  martin
2   jacksmith@gmail.com   jack smith  jack   smith

In [15]:
df.append([df2])

C:\Users\Ajay Singh\AppData\Local\Temp\ipykernel_14664\3294834820.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append([df2])

                    email    full_name first      last
0       johndoe@gmail.com     john doe  john       doe
1    danemartin@gmail.com  dane martin  dane    martin
2     jacksmith@gmail.com   jack smith  jack     smith
3  tonyferguson@email.com          NaN  Tony  ferguson

In [16]:
df

                  email    full_name first    last
0     johndoe@gmail.com     john doe  john     doe
1  danemartin@gmail.com  dane martin  dane  martin
2   jacksmith@gmail.com   jack smith  jack   smith

In [17]:
# To get all rows after appending

df = df.append([df2])
df

C:\Users\Ajay Singh\AppData\Local\Temp\ipykernel_14664\554668851.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append([df2])

                    email    full_name first      last
0       johndoe@gmail.com     john doe  john       doe
1    danemartin@gmail.com  dane martin  dane    martin
2     jacksmith@gmail.com   jack smith  jack     smith
3  tonyferguson@email.com          NaN  Tony  ferguson

In [18]:
# Remove rows

df.drop(index=3, inplace=True)

In [19]:
df

                  email    full_name first    last
0     johndoe@gmail.com     john doe  john     doe
1  danemartin@gmail.com  dane martin  dane  martin
2   jacksmith@gmail.com   jack smith  jack   smith

In [22]:
# Drop rows by condition

filt = df["last"] == "doe"
df.drop(index=df[filt].index, inplace=True)

In [23]:
df

                  email    full_name first    last
1  danemartin@gmail.com  dane martin  dane  martin
2   jacksmith@gmail.com   jack smith  jack   smith

In [24]:
# Droping Multiple Rows

df.drop(index=[1,2], inplace=True)
df

Empty DataFrame
Columns: [email, full_name, first, last]
Index: []